# Homebrew packages for macOS machines.
# Keep Arch/Linux-only apps in apps.json and Hyprland/Waybar config out of here.

# CLI basics used by these dotfiles and shell helpers.
# Prefer mise for CLI tools when they are available there; see
# dot_config/mise/config.toml for the mise-managed tool list.
tap "anomalyco/tap"

brew "bash"
brew "git"
brew "gnupg"
brew "mise"
brew "neovim"
brew "starship"
brew "watch"
brew "zsh-syntax-highlighting"

# AI developer CLIs.
cask "claude-code"
cask "codex-app"
brew "anomalyco/tap/opencode"

# Terminal workflow tools not managed by mise.
brew "autojump"
brew "pv"
brew "sevenzip"
brew "skopeo"
brew "zoxide"

# Fonts and desktop apps.
cask "font-jetbrains-mono-nerd-font"
cask "nikitabobko/tap/aerospace"
cask "ghostty"
cask "gcloud-cli"
cask "megasync"
cask "obsidian"
cask "raycast"
cask "slack"
cask "visual-studio-code"
cask "whatsapp"
cask "zed"
cask "zen"

# Native macOS replacements for webapps.
cask "chatgpt"
cask "grammarly-desktop"
cask "linear"
cask "notion"
cask "proton-drive"
cask "proton-mail"
cask "proton-pass"
cask "protonvpn"
cask "todoist-app"

# Local AI tooling.
cask "lm-studio"
