# Homebrew packages for macOS machines.
# Keep Arch/Linux-only apps in apps.json and Hyprland/Waybar config out of here.

# CLI basics used by these dotfiles and shell helpers.
# Prefer mise for CLI tools when they are available there; see
# dot_config/mise/config.toml for the mise-managed tool list.
tap "anomalyco/tap"

brew "bash"
brew "git"
brew "gnupg"
brew "mise"
brew "watch"

# AI developer CLIs.
brew "claude-code"
brew "codex"
brew "anomalyco/tap/opencode"

# Terminal workflow tools not managed by mise.
brew "autojump"
brew "pv"
brew "sevenzip"
brew "skopeo"

# Fonts and desktop apps.
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "google-cloud-sdk"
cask "megasync"
cask "obsidian"
cask "raycast"
cask "slack"
cask "visual-studio-code"
cask "zed"
cask "zen-browser"

# Native macOS replacements for webapps.
cask "chatgpt"
cask "grammarly-desktop"
cask "linear-linear"
cask "notion"
cask "proton-authenticator"
cask "proton-drive"
cask "proton-mail"
cask "proton-pass"
cask "todoist"

# Local AI tooling.
cask "lm-studio"
